## base
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| update | `module.log_bucket.aws_s3_bucket.this`                    |
|        | `module.log_bucket.aws_s3_bucket_policy.this`             |
| add    | `module.log_bucket.aws_s3_bucket_acl.this`                |
|        | `module.log_bucket.aws_s3_bucket_ownership_controls.this` |
|        | `module.log_bucket.aws_s3_bucket_versioning.this`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "3584062675" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::security-tools-794722365809-logs/*",
                          - "arn:aws:s3:::security-tools-794722365809-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - "aws:SecureTransport" = "false"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::security-tools-794722365809-logs/*",
                              - "arn:aws:s3:::security-tools-794722365809-logs",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "431688896" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::security-tools-794722365809-logs/*",
                          - "arn:aws:s3:::security-tools-794722365809-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.log_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "security-tools-794722365809-logs"
      ~ tags                        = {
          + "Critical"   = "true"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                    = {
          + "Critical"   = "true"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # module.log_bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = "security-tools-794722365809-logs"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.log_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "security-tools-794722365809-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.log_bucket.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "security-tools-794722365809-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::security-tools-794722365809-logs/*",
                          - "arn:aws:s3:::security-tools-794722365809-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.log_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "security-tools-794722365809-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena.aws_s3_bucket.this,
  on .terraform/modules/athena/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.security_tools"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
